using LosSantosRED.lsr.Helper;
using LosSantosRED.lsr.Interface;
using LSR.Vehicles;
using Microsoft.VisualBasic.Logging;
using Rage;
using Rage.Native;
using RAGENativeUI;
using RAGENativeUI.Elements;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.InteropServices;
using System.Runtime.Serialization;
using System.Security.Cryptography.X509Certificates;
using System.Security.Policy;
using System.Text;
using System.Threading.Tasks;


public class WeaponItem : ModItem
{
    private bool IsProgramicallyChangingItems = false;
    private WeaponVariation CurrentWeaponVariation = new WeaponVariation();
    private WeaponInformation WeaponInformation;
    public bool RequiresDLC { get; set; } = false;
    public string ModelName { get; set; }
    public uint ModelHash { get; set; }
    public string VanillaName { get; set; }
    public override bool IsDLC => RequiresDLC;
    public WeaponItem()
    {
    }
    public WeaponItem(string name, string description, bool requiresDLC, ItemType itemType) : base(name, description, itemType)
    {
        RequiresDLC = requiresDLC;
    }
    public override void Setup(PhysicalItems physicalItems, IWeapons weapons, IIntoxicants intoxicants)
    {
        ModelItem = new PhysicalItem(ModelName, ModelHash == 0 ? Game.GetHashKey(ModelName) : ModelHash, ePhysicalItemType.Weapon);
        WeaponInformation = weapons.GetWeapon(ModelItem?.ModelName);
        if (WeaponInformation == null)
        {
            MenuCategory = "Weapon";
        }
        else
        {
            MenuCategory = WeaponInformation.Category.ToString();
        }
    }
    [StructLayout(LayoutKind.Explicit, Size = 0x138)]
    public struct DlcWeaponData
    {
        [FieldOffset(0x00)] public int emptyCheck; //use DLC1::IS_CONTENT_ITEM_LOCKED on this
        [FieldOffset(0x08)] public int weaponHash;
        [FieldOffset(0x18)] public int weaponCost;
        [FieldOffset(0x20)] public int ammoCost;
        [FieldOffset(0x28)] public int ammoType;
        [FieldOffset(0x30)] public int defaultClipSize;
        [FieldOffset(0x38)] public IntPtr nameLabel;
        [FieldOffset(0x78)] public IntPtr descLabel;
        [FieldOffset(0xB8)] public IntPtr desc2Label; // usually "the" + name
        [FieldOffset(0xF8)] public IntPtr upperCaseNameLabel;
    };

    public override string GetTypeDescription()
    {
        string description;
        if (Description.Length >= 200)
        {
            description = Description.Substring(0, 200) + "...";//menu cant show more than 225?, need some for below
        }
        else
        {
            description = Description;
        }
        if (!string.IsNullOrEmpty(VanillaName))
        {
            description += $"~n~Alias: {VanillaName}"; //LOWER CASE OR IT ERRORS!
        }
        description += $"~n~Category: {MenuCategory}";
        if (RequiresDLC)
        {
            description += $"~n~~b~DLC Weapon";
        }
        return Description;
    }

    public override void CreateSellMenuItem(Transaction Transaction, MenuItem menuItem, UIMenu sellMenuRNUI, ISettingsProvideable settings, ILocationInteractable player, bool isStealing, IEntityProvideable world)
    {

        string description;
